#### For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like.

<b>Is the website redesign any good?</b>

rephrase to testable hypothesis: 
- Does the redesigned website have a higer click rate than before, which was 5%? 

null hypothesis: 
- The redesigned website has the same click rate as before, which was 5%.

alternative hypothesis:
- The redesigned website does not have a click rate of 5%

true positive: (reject the null hypothesis and the null hypothesis is false)
- the click rate isn't 5% (and it's not)

true negative: (fail to reject the null hypothesis and the null hypothesis is true)
- the click rate is 5% (and it is)

type 1 error: (reject the null hypothesis and the the null hypothesis is true)
- the click rate is not 5% (but it is) 

type 2 error: (accept the null hypothesis and the null hypothesis is false)
- the click rate is 5% (but it's not)

<b>Is our television ad driving more sales?</b>

rephrase to testable hypothesis: 
- Have our sales increased due to the recent television ads? 

null hypothesis: 
- Our sales have not increased due to television ads. 

alternative hypothesis:
- Our sales have increased due to television ads. 

true positive: (reject the null hypothesis and the null hypothesis is false)
- Our sales have increased due to television ads (and they have increased)

true negative: (fail to reject the null hypothesis and the null hypothesis is true)
- Our sales have not increased due to television ads (and they haven't increased)

type 1 error: (reject the null hypothesis and the the null hypothesis is true)
- Our sales have increased due to television ads (but they haven't increased!)

type 2 error: (accept the null hypothesis and the null hypothesis is false)
- Our sales have not increased due to television ads (but they have increased!)

<b>Has the network latency gone up since we switched internet service providers?</b>

rephrase to testable hypothesis: 
- Has the network latency increased with new internet provider?

null hypothesis: 
- The network latency was not improved since we switched providers

alternative hypothesis:
- The network latency has improved since we switched providers

true positive: (reject the null hypothesis and the null hypothesis is false)
- the network latency has improved (and it has)

true negative: (fail to reject the null hypothesis and the null hypothesis is true)
- the network latency has not improved (and it hasn't)

type 1 error: (reject the null hypothesis and the the null hypothesis is true)
- the network latency has improved (and it hasn't)

type 2 error: (accept the null hypothesis and the null hypothesis is false)
- the network latency has not improved (and it has)

#### Ace Realty wants to determine whether the average time it takes to sell homes is different for its two offices. A sample of 40 sales from office #1 revealed a mean of 90 days and a standard deviation of 15 days. A sample of 50 sales from office #2 revealed a mean of 100 days and a standard deviation of 20 days. Use a .05 level of significance.

In [31]:
from math import sqrt
from scipy import stats

office1_n = 40
office1_mean = 90
office1_sd = 15
office2_n = 50
office2_mean = 100
office2_sd = 20

In [32]:
t = (office1_mean - office2_mean) / (office1_sd - math.sqrt(office1_n))
t

-1.1526786659641493

In [33]:
p = stats.t(office1_n - 1).cdf(t) * 2
p

0.25605872029944227

In [142]:
print("the p value is greater than alpha, therefore, we fail to reject the null hypothesis")

the p value is greater than alpha, therefore, we fail to reject the null hypothesis

#### Load the mpg dataset and use it to answer the following questions:

In [150]:
from pydataset import data
import pandas as pd

mpg = data('mpg')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

Is there a difference in fuel-efficiency in cars from 2008 vs 1999?

> H0: there is no difference in fuel-efficiency cars

In [153]:
mpg["avg_mpg"] = (mpg.cty + mpg.hwy) / 2
mpg.head()

sample1 = mpg [(mpg.year == 1999)].avg_mpg
sample2 = mpg [(mpg.year == 2008)].avg_mpg

stats.ttest_ind(sample1,sample2)

Ttest_indResult(statistic=0.21960177245940962, pvalue=0.8263744040323578)

In [143]:
print("the p value is greater than alpha, therefore, we fail to reject the null hypothesis")

the p value is greater than alpha, therefore, we fail to reject the null hypothesis

Are compact cars more fuel-efficient than the average car?
> H0: compact cars use the same amount of fuel as the average car

In [166]:
mpg.head()

sample3 = mpg [mpg["class"] == "compact"].avg_mpg

stats.ttest_1samp(sample3,mpg.avg_mpg.mean())

Ttest_indResult(statistic=6.731177612837954, pvalue=1.3059121585018135e-10)

In [135]:
print("the p value is extremely low, therefore, we reject the null hypothesis")

the p value is extremely low, therefore, we reject the null hypothesis

Do manual cars get better gas mileage than automatic cars?
> H0: manual cars and automatic cars get the same gas mileage

In [159]:
mpg.head()

sample5 = mpg [mpg["trans"].str.startswith("auto")].avg_mpg
sample6 = mpg [mpg["trans"].str.startswith("man")].avg_mpg

stats.ttest_ind(sample5,sample6)

Ttest_indResult(statistic=-4.593437735750014, pvalue=7.154374401145683e-06)

In [137]:
print("the p value is extremely low, therefore, we reject the null hypothesis")

the p value is extremely low, therefore, we reject the null hypothesis

#### Use the telco_churn data.

In [178]:
df = pd.read_excel('Excel_Exercises.xlsx', sheet_name = "mytable_customer_details")
df.head()

,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,...,has_internet,has_phone_and_internet,partner_dependents,start_day,avg_mn_charge,contract_typeTYPE,phone_serviceTYPE,internet_serviceTYPE,services,tenure_whole
0,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,...,True,True,3,2019-08-19 22:56:20.488,65.6,1 Year,One Line,DSL,Both,9
1,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,...,True,True,0,2019-08-19 22:40:40.067,59.9,Month-to-Month,Two or More Lines,DSL,Both,9
2,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,...,True,True,0,2019-08-25 04:47:24.926,73.9,Month-to-Month,One Line,Fiber Optic,Both,3
3,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,...,True,True,1,2019-08-16 08:51:11.020,98.0,Month-to-Month,One Line,Fiber Optic,Both,12
4,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,...,True,True,1,2019-08-25 19:30:32.181,83.9,Month-to-Month,One Line,Fiber Optic,Both,3

#### Does tenure correlate with monthly charges?

In [183]:
stats.pearsonr(df.tenure_whole, df.monthly_charges)

(0.2471713052965402, 1.588121603295395e-98)

#### Total charges?

In [459]:
df_no_null = df [df.total_charges.isnull() == False]

stats.pearsonr(df_no_null.tenure_whole, df_no_null.total_charges)

(0.8261258900540605, 0.0)

#### What happens if you control for phone and internet service?

In [460]:
df_dsl = df_no_null [df_no_null.internet_serviceTYPE == "DSL"]
stats.pearsonr(df_dsl.tenure_whole, df_dsl.total_charges)

(0.9421395850793447, 0.0)

In [463]:
df_fiber = df_no_null [df_no_null.internet_serviceTYPE == "Fiber Optic"]
stats.pearsonr(df_fiber.tenure_whole, df_fiber.total_charges)

(0.9859241683984012, 0.0)

In [471]:
df_one_line = df_no_null [df_no_null.phone_serviceTYPE == "One Line"]
stats.pearsonr(df_one_line.tenure_whole, df_one_line.total_charges)

(0.7727787601201376, 0.0)

In [472]:
df_two_line = df_no_null [df_no_null.phone_serviceTYPE == "Two or More Lines"]
stats.pearsonr(df_two_line.tenure_whole, df_two_line.total_charges)

(0.8415143440706854, 0.0)

In [474]:
df_no_phone = df_no_null [df_no_null.phone_serviceTYPE == "No Phone Service"]
stats.pearsonr(df_no_phone.tenure_whole, df_no_phone.total_charges)

(0.9546525421425739, 0.0)

#### Use the employees database.

In [278]:
import env

url = env.get_url("employees")
query = """
    SELECT * 
    FROM employees
    JOIN salaries as s USING (emp_no)
    JOIN dept_emp as de USING (emp_no)
    JOIN departments USING (dept_no)
    WHERE s.to_date = "9999-01-01" and de.to_date = "9999-01-01"
    """

df_employees = pd.read_sql(query,url)
df_employees.head()

,dept_no,emp_no,birth_date,first_name,last_name,gender,hire_date,salary,from_date,to_date,from_date,to_date,dept_name
0,d005,10001,1953-09-02,Georgi,Facello,M,1986-06-26,88958,2002-06-22,9999-01-01,1986-06-26,9999-01-01,Development
1,d007,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,72527,2001-08-02,9999-01-01,1996-08-03,9999-01-01,Sales
2,d004,10003,1959-12-03,Parto,Bamford,M,1986-08-28,43311,2001-12-01,9999-01-01,1995-12-03,9999-01-01,Production
3,d004,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,74057,2001-11-27,9999-01-01,1986-12-01,9999-01-01,Production
4,d003,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,94692,2001-09-09,9999-01-01,1989-09-12,9999-01-01,Human Resources

#### Is there a relationship between how long an employee has been with the company and their salary?

In [357]:
from datetime import datetime, date

df_employees["employment_len"] = datetime.now().date() - df_employees.hire_date
df_employees["employment_len"] = df_employees.employment_len.dt.days
df_employees.head()

,dept_no,emp_no,birth_date,first_name,last_name,gender,hire_date,salary,from_date,to_date,from_date,to_date,dept_name,employment_len
0,d005,10001,1953-09-02,Georgi,Facello,M,1986-06-26,88958,2002-06-22,9999-01-01,1986-06-26,9999-01-01,Development,12156
1,d007,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,72527,2001-08-02,9999-01-01,1996-08-03,9999-01-01,Sales,12373
2,d004,10003,1959-12-03,Parto,Bamford,M,1986-08-28,43311,2001-12-01,9999-01-01,1995-12-03,9999-01-01,Production,12093
3,d004,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,74057,2001-11-27,9999-01-01,1986-12-01,9999-01-01,Production,11998
4,d003,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,94692,2001-09-09,9999-01-01,1989-09-12,9999-01-01,Human Resources,10982

In [358]:
stats.pearsonr(df_employees.employment_len, df_employees.salary)

(0.30646256131860783, 0.0)

#### Is there a relationship between how long an employee has been with the company and the number of titles they have had?

In [401]:
pd.read_sql("SHOW TABLES", url)

query2 = """
    SELECT * FROM titles
    JOIN employees USING (emp_no)
    """

df_employees2 = pd.read_sql(query2,url)
df_employees2.head()

,emp_no,title,from_date,to_date,birth_date,first_name,last_name,gender,hire_date
0,10001,Senior Engineer,1986-06-26,9999-01-01,1953-09-02,Georgi,Facello,M,1986-06-26
1,10002,Staff,1996-08-03,9999-01-01,1964-06-02,Bezalel,Simmel,F,1985-11-21
2,10003,Senior Engineer,1995-12-03,9999-01-01,1959-12-03,Parto,Bamford,M,1986-08-28
3,10004,Engineer,1986-12-01,1995-12-01,1954-05-01,Chirstian,Koblick,M,1986-12-01
4,10004,Senior Engineer,1995-12-01,9999-01-01,1954-05-01,Chirstian,Koblick,M,1986-12-01

In [402]:
df_employees2 = df_employees2.groupby("emp_no").count().title
df_employees2 = pd.DataFrame(df_employees2)
df4 = df_employees2.reset_index()
df4.rename(columns = {"title":"num_title"}, inplace=True)
df4.head()

   emp_no  num_title
0   10001          1
1   10002          1
2   10003          1
3   10004          2
4   10005          2

In [403]:
df_final = pd.merge(df4, df_employees, left_on='emp_no', right_on='emp_no', how='inner')
df_final.head()

,emp_no,num_title,dept_no,birth_date,first_name,last_name,gender,hire_date,salary,from_date,to_date,from_date,to_date,dept_name,employment_len
0,10001,1,d005,1953-09-02,Georgi,Facello,M,1986-06-26,88958,2002-06-22,9999-01-01,1986-06-26,9999-01-01,Development,12156
1,10002,1,d007,1964-06-02,Bezalel,Simmel,F,1985-11-21,72527,2001-08-02,9999-01-01,1996-08-03,9999-01-01,Sales,12373
2,10003,1,d004,1959-12-03,Parto,Bamford,M,1986-08-28,43311,2001-12-01,9999-01-01,1995-12-03,9999-01-01,Production,12093
3,10004,2,d004,1954-05-01,Chirstian,Koblick,M,1986-12-01,74057,2001-11-27,9999-01-01,1986-12-01,9999-01-01,Production,11998
4,10005,2,d003,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,94692,2001-09-09,9999-01-01,1989-09-12,9999-01-01,Human Resources,10982

In [404]:
stats.pearsonr(df_final.employment_len, df_final.num_title)

(0.2871267889699719, 0.0)

#### Use the sleepstudy data. Is there a relationship between days and reaction time?

In [214]:
sleepy = data("sleepstudy")
sleepy.head()

   Reaction  Days  Subject
1  249.5600     0      308
2  258.7047     1      308
3  250.8006     2      308
4  321.4398     3      308
5  356.8519     4      308

In [250]:
stats.pearsonr(sleepy.Days, sleepy.Reaction)

(0.5352302262650253, 9.894096322214812e-15)

#### Use the following contingency table to help answer the question of whether using a macbook and being a codeup student are independent of each other.

    Codeup Student	Not Codeup Student
    Uses a Macbook, 49, 20
    Doesn't Use A Macbook, 1, 30

In [407]:
observed = pd.DataFrame([[49, 20], [1, 30]], index=["Uses Mac","Doesn't Use Mac"], columns=["Codeup","Not Codeup"])
observed

                 Codeup  Not Codeup
Uses Mac             49          20
Doesn't Use Mac       1          30

In [410]:
chi2, p, degf, expected = stats.chi2_contingency(observed)

print('Observed\n')
print(observed.values)
print('---\nExpected\n')
print(expected)
print('---\n')
print(f'chi^2 = {chi2:.4f}')
print(f'p     = {p:.4f}')

Observed

[[49 20]
 [ 1 30]]
---
Expected

[[34.5 34.5]
 [15.5 15.5]]
---

chi^2 = 36.6526
p     = 0.0000

#### Choose another 2 categorical variables from the mpg dataset and perform a chi2 contingency table test with them. Be sure to state your null and alternative hypotheses.

In [506]:
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,avg_mpg,transmission
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,auto
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,manual
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,manual
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,auto
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,auto

- h0: the year is independent of transmission type
- h1: the year is not independent of transmission type

In [515]:
observed = pd.crosstab(mpg.cyl, mpg.transmission)
observed

transmission  auto  manual
cyl
4               41      40
5                2       2
6               56      23
8               58      12

In [516]:
chi2, p, degf, expected = stats.chi2_contingency(observed)

print('Observed\n')
print(observed.values)
print('---\nExpected\n')
print(expected)
print('---\n')
print(f'chi^2 = {chi2:.4f}')
print(f'p     = {p:.4f}')

Observed

[[41 40]
 [ 2  2]
 [56 23]
 [58 12]]
---
Expected

[[54.34615385 26.65384615]
 [ 2.68376068  1.31623932]
 [53.0042735  25.9957265 ]
 [46.96581197 23.03418803]]
---

chi^2 = 18.8823
p     = 0.0003

#### Use the data from the employees database to answer these questions:

Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)
Is an employee's gender independent of whether or not they are or have been a manager?

In [479]:
df_employees.head()

,dept_no,emp_no,birth_date,first_name,last_name,gender,hire_date,salary,from_date,to_date,from_date,to_date,dept_name,employment_len
0,d005,10001,1953-09-02,Georgi,Facello,M,1986-06-26,88958,2002-06-22,9999-01-01,1986-06-26,9999-01-01,Development,12156
1,d007,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,72527,2001-08-02,9999-01-01,1996-08-03,9999-01-01,Sales,12373
2,d004,10003,1959-12-03,Parto,Bamford,M,1986-08-28,43311,2001-12-01,9999-01-01,1995-12-03,9999-01-01,Production,12093
3,d004,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,74057,2001-11-27,9999-01-01,1986-12-01,9999-01-01,Production,11998
4,d003,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,94692,2001-09-09,9999-01-01,1989-09-12,9999-01-01,Human Resources,10982

In [480]:
n = df_employees.shape[0]
gender_prop = df_employees.gender.value_counts() / n
gender_prop

M    0.600165
F    0.399835
Name: gender, dtype: float64

In [485]:
sales_prop = df_employees.dept_name.value_counts() / n
sales_prop.Sales, sales_prop.Marketing

(0.1570063800369809, 0.06180973163865336)